app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index #find all articles from database
    #Article.all runs: SELECT * FROM articles
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "adkjf"], ["body", "a;odifa;os"], ["created_at", "2016-03-09 20:00:39.465919"], ["updated_at", "2016-03-09 20:00:39.465919"]]
---
  def create
    puts 'Creating article'
    @article = Article.create(article_params)